In [9]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv("samplefile")
df

(3, 3)

In [1]:
pwd

'C:\\Users\\nitin'

In [6]:
df.to_csv("def", index = False)

In [10]:
rowIndexes = ['A', 'B', 'C', 'D', 'E']
colNames = ['W', 'X', 'Y', 'Z']

In [46]:
np.random.seed(24)
df = pd.DataFrame(np.random.randint(100, size = (5,4)), index = rowIndexes, columns = colNames)
df
# Seed function will freeze the randomness

    W   X   Y   Z
A  34   3  64  87
B  17  17   1  79
C   4  99  82  11
D  99  15  73  18
E   7  25  35  95

In [47]:
df[['W','Z']]

    W   Z
A  34  87
B  17  79
C   4  11
D  99  18
E   7  95

In [50]:
type(df[['W', 'Z']])

pandas.core.frame.DataFrame

In [51]:
df['new'] = df['W'] + df['Y']
df

    W   X   Y   Z  new
A  34   3  64  87   98
B  17  17   1  79   18
C   4  99  82  11   86
D  99  15  73  18  172
E   7  25  35  95   42

In [54]:
df.drop('new',axis=1)

    W   X   Y   Z
A  34   3  64  87
B  17  17   1  79
C   4  99  82  11
D  99  15  73  18
E   7  25  35  95

In [27]:
df

    W   X   Y   Z  new
A  83  40  73  54  156
B  31  76  91  39  122
C  90  25  51   6  141
D  45  12  49  66   94
E  75  85  69  64  144

In [28]:
df.drop('new',axis=1,inplace=True)

In [29]:
df

    W   X   Y   Z
A  83  40  73  54
B  31  76  91  39
C  90  25  51   6
D  45  12  49  66
E  75  85  69  64

In [58]:
df.head(n=2)

    W   X   Y   Z  new
A  34   3  64  87   98
B  17  17   1  79   18

In [34]:
df.tail(n=1)

    W   X   Y   Z
E  75  85  69  64

In [35]:
df.drop('E',axis=0)

    W   X   Y   Z
A  83  40  73  54
B  31  76  91  39
C  90  25  51   6
D  45  12  49  66

In [36]:
df

    W   X   Y   Z
A  83  40  73  54
B  31  76  91  39
C  90  25  51   6
D  45  12  49  66
E  75  85  69  64

In [59]:
df.loc['A']

W      34
X       3
Y      64
Z      87
new    98
Name: A, dtype: int32

In [60]:
df.loc['C','Z']

11

In [57]:
df.loc[:,['W','Z']]

    W   Z
A  83  54
B  31  39
C  90   6
D  45  66
E  75  64

In [67]:
df.loc[['A','B'],['W', 'Z']]

    W   Z
A  83  54
B  31  39

In [53]:
df['W']

A    83
B    31
C    90
D    45
E    75
Name: W, dtype: int32

In [70]:
#df.loc['C'] is same as
df.iloc[2]

W    90
X    25
Y    51
Z     6
Name: C, dtype: int32

In [62]:
df

    W   X   Y   Z  new
A  34   3  64  87   98
B  17  17   1  79   18
C   4  99  82  11   86
D  99  15  73  18  172
E   7  25  35  95   42

In [66]:
df.iloc[2:4,0:2]

    W   X
C   4  99
D  99  15

In [68]:
df.to_csv("")

    W   X   Y   Z  new
A  34   3  64  87   98
B  17  17   1  79   18
C   4  99  82  11   86
D  99  15  73  18  172
E   7  25  35  95   42

In [76]:
# Filter a dataframe
temp = df[df['W']>33]
temp["new"]

A     98
D    172
Name: new, dtype: int32

In [81]:
df[df['W']>0]['Y']

A    73
B    91
C    51
D    49
E    69
Name: Y, dtype: int32

In [41]:
df[df['W']>0][['Y','X']]

    Y   X
A  73  40
B  91  76
C  51  25
D  49  12
E  69  85

In [42]:
df[(df['W']>50) & (df['Y'] > 60) ]

    W   X   Y   Z
A  83  40  73  54
B  31  76  91  39
C  90  25  51   6
D  45  12  49  66
E  75  85  69  64

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
# axis = 0 means across rows
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [94]:
# axis = 1 means across column. May be you will never use this
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [103]:
# Give me those rows having atleast 'n' non-nan
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [104]:
df.fillna(value='10')

    A   B  C
0   1   5  1
1   2  10  2
2  10  10  3

In [105]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [107]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [108]:
df['A'] = np.where(df['A'].isnull(), df['C'],df['A'])
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  3.0  NaN  3

In [109]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  3.0  NaN  3

In [110]:
df['D'] = np.where(df['B'].isnull(), "NaN",df['A'] + df['B'] )
df

     A    B  C    D
0  1.0  5.0  1  6.0
1  2.0  NaN  2  NaN
2  3.0  NaN  3  NaN

In [6]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['nitingujral','def','ghi','xyz']})
df

   col1  col2         col3
0     1   444  nitingujral
1     2   555          def
2     3   666          ghi
3     4   444          xyz

In [8]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [9]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [62]:
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [10]:
df

   col1  col2         col3
0     1   444  nitingujral
1     2   555          def
2     3   666          ghi
3     4   444          xyz

In [11]:
def times2(x):
    return x*2

In [12]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [168]:
df['col3'].apply(len)

0    11
1     3
2     3
3     3
Name: col3, dtype: int64

In [169]:
df

   col1  col2         col3
0     1   444  nitingujral
1     2   555          def
2     3   666          ghi
3     4   444          xyz

In [172]:
df['col2'].sum()

2109

In [173]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [181]:
df.sort_values(by='col2', ascending = False)

   col1  col2         col3
2     3   666          ghi
1     2   555          def
0     1   444  nitingujral
3     4   444          xyz

In [180]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [13]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
type(data)

dict

In [14]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [18]:
by_comp = df.groupby("Company")

In [19]:
from ipywidgets import interact
@interact(x=df['Company'].unique(), y=df.groupby('Company')['Sales'].sum())
def g(x,y):
    return(x,y)

interactive(children=(Dropdown(description='x', options=('GOOG', 'MSFT', 'FB'), value='GOOG'), Dropdown(descri…

In [16]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [196]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [197]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [199]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [200]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [205]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [232]:
lst = pd.read_html('http://stats.espncricinfo.com/ci/content/records/83548.html')
df1 = lst[0]

# Find out records of players with total runs >13000
#df1[df1['Runs'] > 13000]

# FInd out the names of those players who are from INDIA
df1[df1['Player'].str.contains("INDIA")]
# Check syntax for below line
#df1[(df1['Player'].str.split(""))[-1] == "(INDIA)"]

,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,4s,6s
0,SR Tendulkar (INDIA),1989-2012,463,452,41,18426,200*,44.83,21367,86.23,49,96,20,2016,195
5,V Kohli (INDIA),2008-2020,245,236,39,11792,183,59.85,12626,93.39,43,57,13,1109,120
8,SC Ganguly (Asia/INDIA),1992-2007,311,300,23,11363,183,41.02,15416,73.70,22,72,16,1122,190
9,R Dravid (Asia/ICC/INDIA),1996-2011,344,318,40,10889,153,39.16,15284,71.24,12,83,13,950,42
10,MS Dhoni (Asia/INDIA),2004-2019,350,297,84,10773,183*,50.57,12303,87.56,10,73,10,826,229
17,M Azharuddin (INDIA),1985-2000,334,308,54,9378,153*,36.92,12669,74.02,7,58,9,622+,77+
19,RG Sharma (INDIA),2007-2020,224,217,32,9115,264,49.27,10250,88.92,29,43,13,817,244
22,Yuvraj Singh (Asia/INDIA),2000-2017,304,278,40,8701,150,36.55,9924,87.67,14,52,18,908,155
27,V Sehwag (Asia/ICC/INDIA),1999-2013,251,245,9,8273,219,35.05,7929,104.33,15,38,14,1132,136
69,S Dhawan (INDIA),2010-2020,136,133,7,5688,143,45.14,6050,94.01,17,29,5,710,69
71,SK Raina (INDIA),2005-2018,226,194,35,5615,116*,35.31,6005,93.50,5,36,14,476,120
77,A Jadeja (INDIA),1992-2000,196,179,36,5359,119,37.47,7677,69.80,6,30,10,366,85
79,G Gambhir (INDIA),2003-2013,147,143,11,5238,150*,39.68,6144,85.25,11,34,11,561,17

In [140]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [141]:
# used to find out no. of NAN in each column
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [128]:
# used to find out no. of NAN in each column
df['B'].value_counts(dropna = False)

NaN    2
5.0    1
Name: B, dtype: int64